       program-id. Program1 as "StagePOEC.Program1".

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program Program1.
